src/Documents/Перемаркировка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Перемаркировка</Name>
			<BasedOn>
				<xr:Item>Document.ВозвратОтПокупателя</xr:Item>
				<xr:Item>Document.Чек</xr:Item>
				<xr:Item>Document.КорректировкаРеализации</xr:Item>
				<xr:Item>Document.СписаниеКодовМаркировки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.Чек</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПеремаркировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныПеремаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураНовая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатурыНовая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировкиНовый</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оплачен</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПеремаркировки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокументаРегистрации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДокументовСоответствия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокументаСоответствия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокументаСоответствия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПервичногоДокумента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПервичныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПервичногоДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаПеремаркировки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныПеремаркировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроизводства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/СостоянияКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СостоянияКодовМаркировки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>GTIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения номенклатурной позиции</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировкиПолный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировкиУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьКриптохвост</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУпаковокМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроверкиМаркированнойПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящий</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящий</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭДПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Comment>Документ поступления</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСрокаГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыДокументовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленЗапросGTIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноЗаполненGTIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолностьюЗаполненGTIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированаОтгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыИдентификаторовТовараККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыИдентификаторовТовараККТ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КодТовараНеРаспознан</Name>
					<Comment>Код товара, который не распознан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеEAN8</Name>
					<Comment>Код товара в формате EAN-8, UPC-E</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеEAN13</Name>
					<Comment>Код товара в формате EAN-13, UPC-A</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеITF14</Name>
					<Comment>Код товара в формате ITF-14</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеDataMatrixGS1</Name>
					<Comment>Код товара в формате GS1 Data Matrix или Data Matrix маркировки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзделияИзНатуральногоМеха</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеЕГАИС2</Name>
					<Comment>Код товара в кодировке ЕГАИС 2.0 в формате PDF417</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КодТовараВФорматеЕГАИС3</Name>
					<Comment>Код товара в кодировке ЕГАИС 3.0 в формате Data Matrix</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Перемаркировка/Ext/ObjectModule.bsl
// Модуль объекта документа "Перемаркировка"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовПлатформа.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыДокументовМаркировки.Новый;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОсобенностьУчета) Тогда
		Номенклатура = Товары.ВыгрузитьКолонку("Номенклатура");
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(Номенклатура, Товары.ВыгрузитьКолонку("НоменклатураНовая"));
		ОсобенностьУчета = МаркировкаТоваровСервер.ОсобенностьУчетаНоменклатуры(Номенклатура);
	КонецЕсли;
	
	ИдентификаторДокумента = "";
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	Статус = Перечисления.СтатусыДокументовМаркировки.Новый;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим статусы указанных кодов маркировки
	ТаблицаРазбораМаркировки = Новый ТаблицаЗначений;
	ТаблицаРазбораМаркировки.Колонки.Добавить("КодМаркировки", Новый ОписаниеТипов("Строка"
		, , Новый КвалификаторыСтроки(200))
	);
	ТаблицаРазбораМаркировки.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	
	ТипыИдентификаторовТовараККТ = Перечисления.ТипыИдентификаторовТовараККТ.КодТовараВФорматеDataMatrixGS1;
	
	// Разберем маркировку на состовляющие для поиска
	Для Каждого ТекущийКодМаркировки Из Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекущийКодМаркировки.КодМаркировки) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(
			ТекущийКодМаркировки.КодМаркировки
		);
		Если НЕ СтруктураМаркировки.Разобран Тогда
			ВывестиСообщение(
				НСтр("ru = 'Код маркировки <%1> не разобран. Проверьте его корректность.'"),
				ЭтотОбъект,
				, ,
				Отказ,
				ТекущийКодМаркировки.КодМаркировки
			);
			Продолжить;
		КонецЕсли;
		
		Если СтруктураМаркировки.ТипИдентификатораТовара <>
				ТипыИдентификаторовТовараККТ Тогда
			Продолжить;
		КонецЕсли;
		
		КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущийКодМаркировки.КодМаркировки, "", Ложь);
		
		НоваяСтрока = ТаблицаРазбораМаркировки.Добавить();
		НоваяСтрока.КодМаркировки = КодМаркировки;
		НоваяСтрока.НомерСтроки   = ТекущийКодМаркировки.НомерСтроки;
		
	КонецЦикла;
	
	ТекущиеСтатусы = РегистрыСведений.СостоянияКодовМаркировки.ТекущиеСтатусыКодовМаркировки(
		ТаблицаРазбораМаркировки);
	
	// Можем перемаркировкть только маркировку со статусом "Введен в оборот"
	СостоянияПроверки = Новый Массив;
	СостоянияПроверки.Добавить(Перечисления.СостоянияКодовМаркировки.ВведенВОборот);
	СостоянияПроверки.Добавить(Перечисления.СостоянияКодовМаркировки.ВведенВОборотПриВозврате);
	СостоянияПроверки.Добавить(Перечисления.СостоянияКодовМаркировки.ВведенВОборотОжидаетПеремаркировки);
	СостоянияПроверки.Добавить(Перечисления.СостоянияКодовМаркировки.ВыведенИзОборота);
	СостоянияПроверки.Добавить(Перечисления.СостоянияКодовМаркировки.ВыведенИзОборотаПриУтратеИлиПовреждении);
	Для Каждого ТекущаяСтрока Из ТекущиеСтатусы Цикл
		
		Если СостоянияПроверки.Найти(ТекущаяСтрока.Состояние) = Неопределено Тогда
			ВывестиСообщение(
				НСтр("ru = 'Код маркировки <%1> не введен в оборот.'"),
				ЭтотОбъект,
				, ,
				Отказ,
				СокрЛП(ТекущаяСтрока.КодМаркировки)
			);
		КонецЕсли;
		
	КонецЦикла;
	
	// Получим состояния кодов для новых
	ТаблицаРазбораМаркировкиНовые = ТаблицаРазбораМаркировки.Скопировать();
	ТаблицаПроверкиУникальностиКодов = ТаблицаРазбораМаркировки.Скопировать();
	ТаблицаПроверкиУникальностиКодов.Колонки.Добавить("НомерСтрокиНовая", Новый ОписаниеТипов("Число"));
	ТаблицаРазбораМаркировкиНовые.Очистить();
	
	// Разберем маркировку на составляющие для поиска
	Для Каждого ТекущийКодМаркировки Из Товары Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекущийКодМаркировки.КодМаркировкиНовый) Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураМаркировки = МенеджерОборудованияМаркировкаКлиентСервер.РазобратьШтриховойКодТовара(
			ТекущийКодМаркировки.КодМаркировкиНовый
		);
		Если НЕ СтруктураМаркировки.Разобран Тогда
			ВывестиСообщение(
				НСтр("ru = 'Код маркировки <%1> не разобран. Проверьте его корректность.'"),
				ЭтотОбъект,
				, ,
				Отказ,
				ТекущийКодМаркировки.КодМаркировкиНовый
			);
			Продолжить;
		КонецЕсли;
		Если СтруктураМаркировки.ТипИдентификатораТовара <>
				ТипыИдентификаторовТовараККТ Тогда
			Продолжить;
		КонецЕсли;
		
		КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущийКодМаркировки.КодМаркировкиНовый, "", Ложь);
		
		НоваяСтрока = ТаблицаРазбораМаркировкиНовые.Добавить();
		НоваяСтрока.КодМаркировки = КодМаркировки;
		НоваяСтрока.НомерСтроки   = ТекущийКодМаркировки.НомерСтроки;
		
		НоваяСтрока = ТаблицаПроверкиУникальностиКодов.Добавить();
		НоваяСтрока.КодМаркировки    = КодМаркировки;
		НоваяСтрока.НомерСтрокиНовая = ТекущийКодМаркировки.НомерСтроки;
		
	КонецЦикла;
	
	Если НЕ КодыМаркировкиУникальны(ТаблицаПроверкиУникальностиКодов) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ТекущиеСтатусыНовая = РегистрыСведений.СостоянияКодовМаркировки.ТекущиеСтатусыКодовМаркировки(
		ТаблицаРазбораМаркировки);
	
	// Можем перемаркировать только маркировку со статусом "Эмитирован"
	Для Каждого ТекущаяСтрока Из ТекущиеСтатусы Цикл
		
		Если ТекущаяСтрока.Состояние = Перечисления.СостоянияКодовМаркировки.Экспортирован Тогда
			ВывестиСообщение(
				НСтр("ru = 'Код маркировки <%1> не эмитирован.'"),
				ЭтотОбъект,
				"Товары[#].КодМаркировки",
				ТекущаяСтрока.НомерСтроки ,
				Отказ,
				ТекущийКодМаркировки.КодМаркировки
			);
		КонецЕсли;
		
	КонецЦикла;
	
	// Если перемаркируем испорченную, то надо, чтоб КИ совпадал
	Если ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ИспорченаМаркировка Тогда
		Для Каждого ТекущаяСтрока Из ТаблицаРазбораМаркировки Цикл
			НайденнаяСтрока = ТаблицаРазбораМаркировкиНовые.Найти(ТекущаяСтрока.НомерСтроки, "НомерСтроки");
			Если НайденнаяСтрока <> Неопределено И НайденнаяСтрока.GTIN <> ТекущаяСтрока.GTIN Тогда
				ВывестиСообщение(
					НСтр("ru = 'Товары. Строка %1: Указанные коды маркировки имеют разный код товара.'"),
					ЭтотОбъект,
					, ,
					Отказ,
					ТекущаяСтрока.НомерСтроки
				);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЭтоРозничныйВозврат = 
		(ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиРозничнаяПродажа);
	ЭтоДистанционныйВозврат =
		(ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиДистанционнаяПродажа);
	
	Если ЭтоДистанционныйВозврат Тогда
		
		Для Каждого ТекущаяСтрока Из Товары Цикл
			
			Если ТекущаяСтрока.Оплачен <> "Да" Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВидПервичногоДокумента) Тогда
				ВывестиСообщение(
					НСтр("ru = 'Необходимо заполнить вид первичного документа.'"),
					ЭтотОбъект,
					"Товары[#].ВидПервичногоДокумента",
					ТекущаяСтрока.НомерСтроки,
					Отказ
				);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ДатаПервичногоДокумента) Тогда
				ВывестиСообщение(
					НСтр("ru = 'Необходимо заполнить дату первичного документа.'"),
					ЭтотОбъект,
					"Товары[#].ДатаПервичногоДокумента",
					ТекущаяСтрока.НомерСтроки,
					Отказ
				);
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.НомерПервичногоДокумента) Тогда
				ВывестиСообщение(
					НСтр("ru = 'Необходимо заполнить номер первичного документа.'"),
					ЭтотОбъект,
					"Товары[#].НомерПервичногоДокумента",
					ТекущаяСтрока.НомерСтроки,
					Отказ
				);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.НаименованиеПервичногоДокумента) Тогда
				ВывестиСообщение(
					НСтр("ru = 'Необходимо заполнить наименование первичного документа.'"),
					ЭтотОбъект,
					"Товары[#].НаименованиеПервичногоДокумента",
					ТекущаяСтрока.НомерСтроки,
					Отказ
				);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	НоменклатураСоответствуетОсобенностиУчета(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Переведем вид кода маркировки
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		ТекущаяСтрока.КодМаркировки = 
			МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(
				ТекущаяСтрока.КодМаркировки,,
				СтрНачинаетсяС(ТекущаяСтрока.КодМаркировки, "("));
		
		ТекущаяСтрока.КодМаркировкиНовый = 
			МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(
				ТекущаяСтрока.КодМаркировкиНовый,,
				СтрНачинаетсяС(ТекущаяСтрока.КодМаркировкиНовый, "("));
		
	КонецЦикла;
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоВозврат = ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиДистанционнаяПродажа
		ИЛИ ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиРозничнаяПродажа;
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		Если ЭтоВозврат Тогда
			ТекущаяСтрока.Номенклатура = Неопределено;
			ТекущаяСтрока.ХарактеристикаНоменклатуры = Неопределено;
			ТекущаяСтрока.КодМаркировки = "";
		Иначе
			ТекущаяСтрока.ВидПервичногоДокумента = Неопределено;
			ТекущаяСтрока.НаименованиеПервичногоДокумента = "";
			ТекущаяСтрока.ДатаПервичногоДокумента = Дата(1, 1, 1);
			ТекущаяСтрока.НомерПервичногоДокумента = "";
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ Отказ Тогда
	//	РегистрыСведений.ЖурналСостояний.ЗаписьВЖурналСостояний(Ссылка, Статус);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	//НаборЗаписейСостоянияКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	//НаборЗаписейСостоянияКодовМаркировки.ДокументОбъект = ЭтотОбъект;
	//НаборЗаписейСостоянияКодовМаркировки.ОтменаПроведения();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЗаполненияОбъекта

Функция ОбработкаЗаполнения_Чек(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Хозоперация <> Справочники.ХозОперации.ЧекНаВозврат Тогда
		ТекстСообщения = НСтр("ru = 'Перемаркировка доступна только при вводе на основании чека на возврат.'");
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ДанныеЗаполнения, ТекстСообщения);
	КонецЕсли;

	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"Товары"
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиРозничнаяПродажа;
	ЗаполнитьТабличнуюЧастьТоваровПоОснованию(
		ДанныеЗаполнения,
		Перечисления.ВидыПервичныхДокументов.КассовыйЧек,
		НСтр("ru = 'Чек на возврат'")
	);
	
	Возврат Истина;
	
КонецФункции

Функция ОбработкаЗаполнения_ВозвратОтПокупателя(ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"Товары"
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиРозничнаяПродажа;
	
	ЗаполнитьТабличнуюЧастьТоваровПоОснованию(
		ДанныеЗаполнения,
		Перечисления.ВидыПервичныхДокументов.ТоварныйЧек,
		НСтр("ru = 'Возврат от покупателя'")
	);
	
	Возврат Истина;
	
КонецФункции

Функция ОбработкаЗаполнения_СписаниеКодовМаркировки(ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Хозоперация <> Справочники.ХозОперации.СписаниеНанесенныхКодовМаркировки Тогда
		ТекстСообщения = НСтр(
			"ru = 'Перемаркировка доступна только при вводе на основании списания КМ, нанесенных на товар.'"
		);
		УправлениеДиалогомСервер.ЗапретитьОткрытиеФормыОбъекта(ДанныеЗаполнения, ТекстСообщения);
	КонецЕсли;
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"Товары"
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ИспорченаМаркировка;
	
	ЗаполнитьТабличнуюЧастьТоваровПоОснованию(
		ДанныеЗаполнения,
		Перечисления.ВидыПервичныхДокументов.Прочее,
		НСтр("ru = 'Списание кодов маркировки'")
	);
	
	Возврат Истина;
	
КонецФункции

Функция ОбработкаЗаполнения_КорректировкаРеализации(ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"Товары"
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиРозничнаяПродажа;
	
	Товары.Очистить();
	
	// Заполним ТЧ Товары только теми товарами, которые на уменьшение и не указаны коды
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	СтруктураПоиска.Вставить("Возврат", Истина);
	Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.Товары Цикл
		
		РазностьКоличества = -ТекущаяСтрока.КоличествоРазница;
		
		// Количество не было уменьшено
		Если РазностьКоличества <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Получим штучный товар
		РазностьКоличества = РазностьКоличества * ТекущаяСтрока.Коэффициент;
		
		// Проверим, что количество возвратов совпадает с количеством разницы
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
		НайденныеСтроки = ДанныеЗаполнения.КодыМаркировки.НайтиСтроки(СтруктураПоиска);
		
		// Уберем указанные маркировки к возврату
		РазностьКоличества = РазностьКоличества - НайденныеСтроки.Количество();
		
		Пока РазностьКоличества > 0 Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.НоменклатураНовая = ТекущаяСтрока.Номенклатура;
			Документы.Перемаркировка.ТоварыНоменклатураНоваяПриИзменении(ЭтотОбъект, НоваяСтрока);
			НоваяСтрока.ХарактеристикаНоменклатурыНовая = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			
			НоваяСтрока.ВидПервичногоДокумента = Перечисления.ВидыПервичныхДокументов.Прочее;
			НоваяСтрока.НомерПервичногоДокумента = ДанныеЗаполнения.Номер;
			НоваяСтрока.ДатаПервичногоДокумента = ДанныеЗаполнения.Дата;
			НоваяСтрока.НаименованиеПервичногоДокумента = НСтр("ru = 'Корректировка реализации'");
			НоваяСтрока.ДатаПеремаркировки = Дата;
			
			РазностьКоличества = РазностьКоличества - 1;
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТабличнуюЧастьТоваровПоОснованию(ДанныеЗаполнения, ВидПервичногоДокумента, НаименованиеДокумента)
	
	Товары.Очистить();
	
	СтруктураПоиска = Новый Структура("ИдентификаторТовара");
	
	// Найдем номенклатуру, у которой не отсканировали код
	Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.Товары Цикл
		
		//Если НЕ ТекущаяСтрока.Номенклатура.ТипНоменклатуры.ВедетсяМаркировка Тогда
		//	Продолжить;
		//КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
		
		Попытка
			НайденныеСтроки = ДанныеЗаполнения.КодыМаркировки.НайтиСтроки(СтруктураПоиска);
			КоличествоБезМаркировки = (ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент - НайденныеСтроки.Количество());
		Исключение
			КоличествоБезМаркировки = 1;
		КонецПопытки;
		
		Пока КоличествоБезМаркировки > 0 Цикл
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.НоменклатураНовая = ТекущаяСтрока.Номенклатура;
			Документы.Перемаркировка.ТоварыНоменклатураНоваяПриИзменении(ЭтотОбъект, НоваяСтрока);
			НоваяСтрока.ХарактеристикаНоменклатурыНовая = ТекущаяСтрока.ХарактеристикаНоменклатуры;
			
			НоваяСтрока.ВидПервичногоДокумента = ВидПервичногоДокумента;
			НоваяСтрока.НомерПервичногоДокумента = ДанныеЗаполнения.Номер;
			НоваяСтрока.ДатаПервичногоДокумента = ДанныеЗаполнения.Дата;
			НоваяСтрока.НаименованиеПервичногоДокумента = НаименованиеДокумента;
			НоваяСтрока.ДатаПеремаркировки = Дата;
			
			КоличествоБезМаркировки = КоличествоБезМаркировки - 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция КодыМаркировкиУникальны(ТаблицаПроверкиУникальностиКодов)
	
	Результат = Истина;
	
	ТаблицаПроверкиУникальностиКодов.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаПроверкиУникальностиКодов.ЗаполнитьЗначения(1, "Количество");
	КопияТаблицы = ТаблицаПроверкиУникальностиКодов.Скопировать();
	
	ТаблицаПроверкиУникальностиКодов.Свернуть("КодМаркировки", "Количество");
	
	Для Каждого Строка Из ТаблицаПроверкиУникальностиКодов Цикл
		Если Строка.Количество > 1 Тогда
			Результат = Ложь;
			НайденныеСтроки = КопияТаблицы.НайтиСтроки(Новый Структура("КодМаркировки", Строка.КодМаркировки));
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				ВывестиСообщение(
					НСтр("ru = 'Код маркировки <%1> не уникален.'"),
					ЭтотОбъект,
					?(НайденнаяСтрока.НомерСтрокиНовая > 0, "Товары[#].КодМаркировкиНовый", "Товары[#].КодМаркировки"),
					?(НайденнаяСтрока.НомерСтрокиНовая > 0, НайденнаяСтрока.НомерСтрокиНовая, НайденнаяСтрока.НомерСтроки),
					,
					Строка.КодМаркировки
				);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура НоменклатураСоответствуетОсобенностиУчета(Отказ)
	
	ЭтоВозврат = ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиДистанционнаяПродажа
		ИЛИ ПричинаПеремаркировки = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиРозничнаяПродажа;
	
	ОсобенностьУчетаПредставление = Строка(ОсобенностьУчета);
	
	Если НЕ ЭтоВозврат Тогда
		ТаблицаДляПроверки = МаркировкаТоваровСервер.ОсобенностьУчетаВТаблице(Товары, "Номенклатура");
		Для Каждого ТекущаяСтрока Из ТаблицаДляПроверки Цикл
			Если НЕ ТекущаяСтрока.ОсобенностьУчета = ОсобенностьУчета Тогда
				ВывестиСообщение(
				НСтр("ru = 'Особенность учета номенклатуры ""%1"" недопустима для особенности учета документа ""%2"".'"),
				ЭтотОбъект,
				"Товары[#].Номенклатура", 
				ТекущаяСтрока.НомерСтроки,
				Отказ,
				ТекущаяСтрока.Номенклатура,
				ОсобенностьУчетаПредставление
			);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаДляПроверки = МаркировкаТоваровСервер.ОсобенностьУчетаВТаблице(Товары, "НоменклатураНовая");
	Для Каждого ТекущаяСтрока Из ТаблицаДляПроверки Цикл
		Если НЕ ТекущаяСтрока.ОсобенностьУчета = ОсобенностьУчета Тогда
			ВывестиСообщение(
			НСтр("ru = 'Особенность учета новой номенклатуры ""%1"" недопустима для особенности учета документа ""%2"".'"),
			ЭтотОбъект,
			"Товары[#].Номенклатура", 
			ТекущаяСтрока.НомерСтроки,
			Отказ,
			ТекущаяСтрока.Номенклатура,
			ОсобенностьУчетаПредставление
		);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
